package org.example;

import java.time.LocalDate;
import java.util.UUID;

/********************************************************************************************************
 * Контрольная точка.                                                                                   *
 * @author Селетков И.П. 2022 1030.                                                                     *
 *******************************************************************************************************/
public class CControl
{
    /****************************************************************************************************
     * Идентификатор.                                                                                   *
     ***************************************************************************************************/
    private UUID id;

    public UUID getId() {
        return id;
    }

    public void setId(UUID id) {
        this.id = id;
    }

    /****************************************************************************************************
     * Дата проведения.                                                                                 *
     ***************************************************************************************************/
    private LocalDate date;

    public LocalDate getDate() {
        return date;
    }

    public void setDate(LocalDate date) {
        this.date = date;
    }
    /****************************************************************************************************
     * Наименование.                                                                                    *
     ***************************************************************************************************/
    private String name;

    public String getName() {
        return name;
    }

    public void setName(String name) {
        this.name = name;
    }
}
