package org.example;

import java.util.UUID;
/********************************************************************************************************
 * Оценка за контрольную точку.                                                                         *
 * @author Селетков И.П. 2022 0926.                                                                     *
 *******************************************************************************************************/
public class CMark {
    /****************************************************************************************************
     * Идентификатор.                                                                                   *
     ***************************************************************************************************/
    private UUID id;
    public UUID getId() {
        return id;
    }
    public void setId(UUID id) {
        this.id = id;
    }
    /****************************************************************************************************
     * Балл.                                                                                            *
     ***************************************************************************************************/
    private double value;

    public double getValue() {
        return value;
    }

    public void setValue(double value) {
        this.value = value;
    }


    /****************************************************************************************************
     * Студент.                                                                                         *
     ***************************************************************************************************/
    private CStudent student;
    public CStudent getStudent() {
        return student;
    }

    public void setStudent(CStudent student) {
        this.student = student;
    }



    @Override
    public String toString() {
        return "Студент: "+((student==null) ? "не указан":student.getName())+" Балл: "+value;
    }

    /****************************************************************************************************
     * Контрольная точка.                                                                               *
     ***************************************************************************************************/
    private CControl control;
    public CControl getControl() {
        return control;
    }

    public void setControl(CControl control) {
        this.control = control;
    }
}
