package org.example;

import java.util.ArrayList;
import java.util.List;
import java.util.UUID;
/********************************************************************************************************
 * Студент.                                                                                             *
 * @author Селетков И.П. 2022 0926.                                                                     *
 *******************************************************************************************************/
public class CStudent {
    /****************************************************************************************************
     * Идентификатор.                                                                                   *
     ***************************************************************************************************/
    private UUID id;

    public UUID getId() {
        return id;
    }

    public void setId(UUID id) {
        this.id = id;
    }
    /****************************************************************************************************
     * Ф.И.О.                                                                                           *
     ***************************************************************************************************/
    private String name;

    public String getName() {
        return name;
    }

    public void setName(String name) {
        this.name = name;
    }

    @Override
    public String toString() {
        return "id: "+id+" name: "+name;
    }
    /****************************************************************************************************
     * Список оценок.                                                                                   *
     ***************************************************************************************************/
    private List<CMark> marks;

    public List<CMark> getMarks() {
        return marks;
    }

    public void setMarks(List<CMark> marks) {
        this.marks = marks;
    }
    /****************************************************************************************************
     * Конструктор по-умолчанию.                                                                        *
     ***************************************************************************************************/
    public CStudent()
    {
        //При создании объекта один раз создаём пустой список оценок, с которым дальше будем работать.
        marks = new ArrayList<>();
    }

}
